Autodesk.Revit.DB.SpotDimension.SpotDimensionType
The dimension style of this dimension.

Autodesk.Revit.DB.SpotDimension.Location
Get a location point object. This is the location of the spot dimension.

Autodesk.Revit.DB.SpotDimension
An object that represents a spot dimension within the Revit project.